SELECT
    mydb."Список товаров в заказе"."id_Товар",
    "Текущая цена"
FROM
    mydb."Список товаров в заказе"
    JOIN mydb."Цена товара" ON mydb."Список товаров в заказе"."id_Товар" = mydb."Цена товара"."id_Предложения"
WHERE
    mydb."Список товаров в заказе"."id_Заказ" = 1
    AND mydb."Цена товара"."Дата" = (
        SELECT
            MAX(mydb."Цена товара"."Дата")
        FROM
            mydb."Цена товара"
        WHERE
            mydb."Список товаров в заказе"."id_Товар" = mydb."Цена товара"."id_Предложения"
    );