SELECT
    "Краткое описание" AS "Название товара",
    MIN("Дата") AS "Дата первого появления",
    COUNT(DISTINCT "idПокупатель") AS "Кол-во покупателей",
    SUM("Количество") AS "Кол-во проданного товара",
    COUNT(*) FILTER (
        WHERE
            "Оценка" = 1
    ) AS "Число оценок 1",
    COUNT(*) FILTER (
        WHERE
            "Оценка" = 2
    ) AS "Число оценок 2",
    COUNT(*) FILTER (
        WHERE
            "Оценка" = 3
    ) AS "Число оценок 3",
    COUNT(*) FILTER (
        WHERE
            "Оценка" = 4
    ) AS "Число оценок 4",
    COUNT(*) FILTER (
        WHERE
            "Оценка" = 5
    ) AS "Число оценок 5",
    ROUND(AVG("Оценка"), 2) AS "Среднее значение",
    PERCENTILE_CONT(0.5) WITHIN GROUP (
        ORDER BY
            "Оценка"
    ) AS "Медианное значение"
FROM
    mydb."Отзыв о товаре"
    JOIN mydb."Предложение" ON mydb."Отзыв о товаре"."id_Товар" = mydb."Предложение"."id_Предложения"
    JOIN mydb."Товар" ON mydb."Предложение"."Артикул" = mydb."Товар"."Артикул"
    JOIN mydb."Заказ" ON mydb."Отзыв о товаре"."id_Заказ" = mydb."Заказ"."id_Заказ"
    JOIN mydb."Список товаров в заказе" ON mydb."Список товаров в заказе"."id_Заказ" = mydb."Отзыв о товаре"."id_Заказ"
WHERE
    mydb."Заказ"."Код статуса заказа" = 5
    AND mydb."Список товаров в заказе"."id_Товар" = mydb."Отзыв о товаре"."id_Товар"
GROUP BY
    mydb."Товар"."Краткое описание"